Link: https://www.youtube.com/watch?v=mJlRTUuVr04&list=PLKnIA16_Rmvbr7zKYQuBfsVkjoLcJgxHH&index=19
Link: https://www.youtube.com/watch?v=uDr67HBIPz8&list=PL5aNSbIIYFHXDUG7RJSvCaNnq9J28jRMA&index=1&t=1035s

Featured of Columns

Basic 7 Questions for Dataset:
1. How Big is the Data ?  Code >>> df.shape
2. How does the Data look like ? Code >>> df.head() or df.sample(5) Note: sample() use for random Data
3. What is the Data Type of Columns ? Code >>> df.info()  
4. Are there any missing values ?  Code >>> df.isnull().sum()
5. How Does The Data Look Mathematically ? Code >>> df.describe()
6. Are there any Duplicate Values ? Code >>> df.duplicated().sum() IF get Any Duplicate Values then use df.drop_duplicates()
7. How is the Corelation Between Columns ? Code >>> df.corr()

In [2]:
import numpy as np
import pandas as pd

In [3]:
df = pd.read_csv('titanic.csv')
df

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0.0,3.0,male,22.0,1.0,0.0,7.25,S,Third,man,True,NaN,Southampton,no,False
1,1.0,1.0,female,NaN,1.0,0.0,NaN,C,First,NaN,False,C,NaN,yes,False
2,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,1.0,1.0,female,35.0,1.0,0.0,53.10,S,First,woman,False,C,Southampton,yes,False
4,0.0,3.0,male,35.0,0.0,0.0,8.05,S,Third,man,True,NaN,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0.0,2.0,male,27.0,0.0,0.0,13.00,S,Second,man,True,NaN,Southampton,no,True
887,1.0,1.0,female,19.0,0.0,0.0,30.00,S,First,woman,False,B,Southampton,yes,True
888,0.0,3.0,female,NaN,1.0,2.0,23.45,S,Third,woman,False,NaN,Southampton,no,False
889,1.0,1.0,male,26.0,0.0,0.0,30.00,C,First,man,True,C,Cherbourg,yes,True
890,0.0,3.0,male,32.0,0.0,0.0,7.75,Q,Third,man,True,NaN,Queenstown,no,True

Show Data Fream from top with mentioned number of value

In [6]:
df.head(100)

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0.0,3.0,male,22.0,1.0,0.0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1.0,1.0,female,NaN,1.0,0.0,NaN,C,First,NaN,False,C,NaN,yes,False
2,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,1.0,1.0,female,35.0,1.0,0.0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0.0,3.0,male,35.0,0.0,0.0,8.0500,S,Third,man,True,NaN,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
95,0.0,3.0,male,NaN,0.0,0.0,8.0500,S,Third,man,True,NaN,Southampton,no,True
96,0.0,1.0,male,71.0,0.0,0.0,34.6542,C,First,man,True,A,Cherbourg,no,True
97,1.0,1.0,male,23.0,0.0,1.0,63.3583,C,First,man,True,D,Cherbourg,yes,False
98,1.0,2.0,female,34.0,0.0,1.0,23.0000,S,Second,woman,False,NaN,Southampton,yes,False
99,0.0,2.0,male,34.0,1.0,0.0,26.0000,S,Second,man,True,NaN,Southampton,no,False

Show Data Fream from bottom with mentioned number of value

In [8]:
df.tail(10)

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
881,0.0,3.0,male,33.0,0.0,0.0,7.8958,S,Third,man,True,NaN,Southampton,no,True
882,0.0,3.0,female,22.0,0.0,0.0,10.5167,S,Third,woman,False,NaN,Southampton,no,True
883,0.0,2.0,male,28.0,0.0,0.0,10.5000,S,Second,man,True,NaN,Southampton,no,True
884,0.0,3.0,male,25.0,0.0,0.0,7.0500,S,Third,man,True,NaN,Southampton,no,True
885,0.0,3.0,female,39.0,0.0,5.0,29.1250,Q,Third,woman,False,NaN,Queenstown,no,False
886,0.0,2.0,male,27.0,0.0,0.0,13.0000,S,Second,man,True,NaN,Southampton,no,True
887,1.0,1.0,female,19.0,0.0,0.0,30.0000,S,First,woman,False,B,Southampton,yes,True
888,0.0,3.0,female,NaN,1.0,2.0,23.4500,S,Third,woman,False,NaN,Southampton,no,False
889,1.0,1.0,male,26.0,0.0,0.0,30.0000,C,First,man,True,C,Cherbourg,yes,True
890,0.0,3.0,male,32.0,0.0,0.0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True

Show Column Name, Data Type and Number of  non-null Records in a Data Fream

In [10]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     890 non-null    float64
 1   pclass       890 non-null    float64
 2   sex          890 non-null    object
 3   age          712 non-null    float64
 4   sibsp        890 non-null    float64
 5   parch        890 non-null    float64
 6   fare         889 non-null    float64
 7   embarked     888 non-null    object
 8   class        890 non-null    object
 9   who          889 non-null    object
 10  adult_male   890 non-null    object
 11  deck         203 non-null    object
 12  embark_town  887 non-null    object
 13  alive        890 non-null    object
 14  alone        890 non-null    object
dtypes: float64(6), object(9)
memory usage: 104.5+ KB

Show Number of Row and Columns in a Data Fream

In [12]:
df.shape

(891, 15)

In [5]:
df.sample(10)  # Show Random Data

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
223,0.0,3.0,male,NaN,0.0,0.0,7.8958,S,Third,man,True,NaN,Southampton,no,True
784,0.0,3.0,male,25.0,0.0,0.0,7.0500,S,Third,man,True,NaN,Southampton,no,True
875,1.0,3.0,female,15.0,0.0,0.0,7.2250,C,Third,child,False,NaN,Cherbourg,yes,True
880,1.0,2.0,female,25.0,0.0,1.0,26.0000,S,Second,woman,False,NaN,Southampton,yes,False
325,1.0,1.0,female,36.0,0.0,0.0,135.6333,C,First,woman,False,C,Cherbourg,yes,True
521,0.0,3.0,male,22.0,0.0,0.0,7.8958,S,Third,man,True,NaN,Southampton,no,True
793,0.0,1.0,male,NaN,0.0,0.0,30.6958,C,First,man,True,NaN,Cherbourg,no,True
506,1.0,2.0,female,33.0,0.0,2.0,26.0000,S,Second,woman,False,NaN,Southampton,yes,False
356,1.0,1.0,female,22.0,0.0,1.0,55.0000,S,First,woman,False,E,Southampton,yes,False
532,0.0,3.0,male,17.0,1.0,1.0,7.2292,C,Third,man,True,NaN,Cherbourg,no,False

Show, is there any duplicate or repeted value in the data fream ?

In [8]:
df.duplicated()

0      False
1      False
2      False
3      False
4      False
       ...
886     True
887    False
888    False
889    False
890    False
Length: 891, dtype: bool

In [7]:
df.duplicated().sum()

107

How to Drop Duplicate Values ?

In [13]:
df.drop_duplicates()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0.0,3.0,male,22.0,1.0,0.0,7.250,S,Third,man,True,NaN,Southampton,no,False
1,1.0,1.0,female,NaN,1.0,0.0,NaN,C,First,NaN,False,C,NaN,yes,False
2,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,1.0,1.0,female,35.0,1.0,0.0,53.100,S,First,woman,False,C,Southampton,yes,False
4,0.0,3.0,male,35.0,0.0,0.0,8.050,S,Third,man,True,NaN,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
885,0.0,3.0,female,39.0,0.0,5.0,29.125,Q,Third,woman,False,NaN,Queenstown,no,False
887,1.0,1.0,female,19.0,0.0,0.0,30.000,S,First,woman,False,B,Southampton,yes,True
888,0.0,3.0,female,NaN,1.0,2.0,23.450,S,Third,woman,False,NaN,Southampton,no,False
889,1.0,1.0,male,26.0,0.0,0.0,30.000,C,First,man,True,C,Cherbourg,yes,True
890,0.0,3.0,male,32.0,0.0,0.0,7.750,Q,Third,man,True,NaN,Queenstown,no,True

Show, number of duplicate or repeted value in the data fream

In [17]:
df.duplicated().sum()

107

Show Number of Unique value in the columns of a data fream

In [20]:
df.nunique()

survived         2
pclass           3
sex              2
age             88
sibsp            7
parch            7
fare           247
embarked         3
class            3
who              3
adult_male       2
deck             7
embark_town      3
alive            2
alone            2
dtype: int64

Show All Columns Name in the Data Fream

In [22]:
df.columns

Index(['survived', 'pclass', 'sex', 'age', 'sibsp', 'parch', 'fare',
       'embarked', 'class', 'who', 'adult_male', 'deck', 'embark_town',
       'alive', 'alone'],
      dtype='object')

Show How many columns in the Data Fream

In [24]:
print(len(df.columns))

15

Show the Name of Entities in the Column

In [28]:
df['embark_town'].unique()

array(['Southampton', nan, 'Queenstown', 'Cherbourg'], dtype=object)

Show the Number of Entities in the Column

In [31]:
df['embark_town'].nunique()

3

Show How many number of each Entity in the column

In [33]:
df['embark_town'].value_counts()

embark_town
Southampton    643
Cherbourg      167
Queenstown      77
Name: count, dtype: int64

Show all kind of Data Type in the Dataset

In [37]:
df.dtypes

survived       float64
pclass         float64
sex             object
age            float64
sibsp          float64
parch          float64
fare           float64
embarked        object
class           object
who             object
adult_male      object
deck            object
embark_town     object
alive           object
alone           object
dtype: object

Show is there any Null Field in the Dataset

In [40]:
df.isnull()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,False,False,False,False,False,False,False,False,False,False,False,True,False,False,False
1,False,False,False,True,False,False,True,False,False,True,False,False,True,False,False
2,True,True,True,True,True,True,True,True,True,True,True,True,True,True,True
3,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False
4,False,False,False,False,False,False,False,False,False,False,False,True,False,False,False
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,False,False,False,False,False,False,False,False,False,False,False,True,False,False,False
887,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False
888,False,False,False,True,False,False,False,False,False,False,False,True,False,False,False
889,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False
890,False,False,False,False,False,False,False,False,False,False,False,True,False,False,False

Show Column wise all null values in the Dataset

In [42]:
df.isnull().sum()

survived         1
pclass           1
sex              1
age            179
sibsp            1
parch            1
fare             2
embarked         3
class            1
who              2
adult_male       1
deck           688
embark_town      4
alive            1
alone            1
dtype: int64

Show Total number of Null Values in the Dataset

In [44]:
df.isnull().sum().sum()

887

How Does The Data Look Mathematically ? Code >>> df.describe()

In [14]:
df.describe()

         survived      pclass         age       sibsp       parch        fare
count  890.000000  890.000000  712.000000  890.000000  890.000000  889.000000
mean     0.383146    2.307865   29.692654    0.523596    0.382022   32.187560
std      0.486427    0.836220   14.542920    1.103224    0.806409   49.725393
min      0.000000    1.000000    0.420000    0.000000    0.000000    0.000000
25%      0.000000    2.000000   20.000000    0.000000    0.000000    7.895800
50%      0.000000    3.000000   28.000000    0.000000    0.000000   14.454200
75%      1.000000    3.000000   38.000000    1.000000    0.000000   31.000000
max      1.000000    3.000000   80.000000    8.000000    6.000000  512.329200

How is the Corelation Between Columns ?

In [15]:
df.corr()

ValueError: could not convert string to float: 'male'